In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'통계': [60, 70, 80 ,85, 75], '미술': [50, 55, 80, 100, 95], '체육': [70, 65, 50, 95, 100]})
df

   통계   미술   체육
0  60   50   70
1  70   55   65
2  80   80   50
3  85  100   95
4  75   95  100

In [7]:
type(df['통계'])

pandas.core.series.Series

<h3> column간 연산

In [10]:
df['합'] = df['통계']+df['미술']+df['체육']
df

   통계   미술   체육    합
0  60   50   70  180
1  70   55   65  190
2  80   80   50  210
3  85  100   95  280
4  75   95  100  270

In [12]:
df['통계'] / df['합']

0    0.333333
1    0.368421
2    0.380952
3    0.303571
4    0.277778
dtype: float64

In [14]:
df

   통계   미술   체육    합
0  60   50   70  180
1  70   55   65  190
2  80   80   50  210
3  85  100   95  280
4  75   95  100  270

In [18]:
#case 1
df.mean(axis=0)
#case3 2
df.mean(axis=1)

0     90.0
1     95.0
2    105.0
3    140.0
4    135.0
dtype: float64

In [19]:
df1 = pd.DataFrame({'통계': [60, 70, 80 ,85, 75], '미술': [50, 55, 80, 100, 95], '체육': [70, 65, 50, 95, 100]})
df2 = pd.DataFrame({'통계': ['good', 'bad', 'ok', 'good', 'ok'], '미술': [50, 55, 80, 100, 95], '체육': [70, 65, 50, 95, 100]})

In [22]:
df2

     통계   미술   체육
0  good   50   70
1   bad   55   65
2    ok   80   50
3  good  100   95
4    ok   95  100

In [24]:
df1['미술'] + df2['미술']

0    100
1    110
2    160
3    200
4    190
Name: 미술, dtype: int64